# NullParameterValue Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
NullParameterValue Constructor
NullParameterValue Class See Also
---
Default constructor
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public NullParameterValue()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
NullParameterValue()
```

# See Also
NullParameterValue Class
Autodesk.Revit.DB Namespace